app/views/loans/_form.html.erb

SELECT "readers".* FROM "readers"
---

    <% options = Reader.all.collect do |r| %>

SELECT "books".* FROM "books"
---

    <% opt = Book.all.collect do |b| %>