app/controllers/books_controller.rb

INSERT INTO "books" ("author", "created_at", "image", "loan_id", "title", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

UPDATE "books" SET "loan_id" = ?, "updated_at" = ? WHERE "books"."id" = 3  [["loan_id", 3], ["updated_at", "2014-11-15 17:45:38.302498"]]
---
  def update
    respond_to do |format|
      if @book.update(book_params)