app/controllers/loans_controller.rb

  def index
    @loans = Loan.all
---
SELECT "loans".* FROM "loans"

  def create
    @loan = Loan.new(loan_params)

    respond_to do |format|
      if @loan.save
---
INSERT INTO "loans" ("book_id", "created_at", "date_loan", "date_return", "reader_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["book_id", 5], ["created_at", "2014-11-18 21:42:46.074324"], ["date_loan", "2014-11-18"], ["date_return", "2014-11-20"], ["reader_id", 4], ["updated_at", "2014-11-18 21:42:46.074324"]]

  def update
    respond_to do |format|
      if @loan.update(loan_params)
---
UPDATE "loans" SET "penalty" = ?, "updated_at" = ? WHERE "loans"."id" = 2  [["penalty", nil], ["updated_at", "2014-11-17 18:47:02.018513"]]

    def set_loan
      @loan = Loan.find(params[:id])
---
SELECT  "loans".* FROM "loans"  WHERE "loans"."id" = ? LIMIT 1  [["id", 2]]