app/controllers/readers_controller.rb

SELECT "readers".* FROM "readers"
---
  def index
    @readers = Reader.all

INSERT INTO "readers" ("address", "created_at", "email", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @reader = Reader.new(reader_params)

    respond_to do |format|
      if @reader.save

SELECT  "readers".* FROM "readers"  WHERE "readers"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_reader
      @reader = Reader.find(params[:id])